Public Member Functions | Public Attributes | List of all members
API_Quantities Class Reference
Element Manager API
Describes the different calculated values for skins of composite or complex elements. More...
#include <APIdefs_Elements.h>
 Public Member Functions
API_Quantities ()
 Public Attributes
API_ElementQuantity *  | elements
GS::Array< API_CompositeQuantity > *  | composites
GS::Array< API_ElemPartQuantity > *  | elemPartQuantities
GS::Array< API_ElemPartCompositeQuantity > *  | elemPartComposites
Detailed Description
Describes the different calculated values for skins of composite or complex elements.
Constructor & Destructor Documentation
◆ API_Quantities()
 API_Quantities::API_Quantities  |  ( |   | )
inline
Member Data Documentation
◆ composites
 GS::Array<API_CompositeQuantity>* API_Quantities::composites
◆ elements
 API_ElementQuantity* API_Quantities::elements
◆ elemPartComposites
 GS::Array<API_ElemPartCompositeQuantity>* API_Quantities::elemPartComposites
◆ elemPartQuantities
 GS::Array<API_ElemPartQuantity>* API_Quantities::elemPartQuantities